; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	thermograph0 - mode
	infrared1 - mode
	infrared2 - mode
	GroundStation6 - direction
	Star8 - direction
	Star9 - direction
	Star2 - direction
	GroundStation5 - direction
	GroundStation3 - direction
	Star1 - direction
	Star0 - direction
	GroundStation7 - direction
	GroundStation4 - direction
	Phenomenon10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Planet14 - direction
)
(:init
	(supports instrument0 infrared2)
	(calibration_target instrument0 Star2)
	(supports instrument1 thermograph0)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star1)
	(calibration_target instrument1 GroundStation3)
	(calibration_target instrument1 GroundStation5)
	(supports instrument2 infrared1)
	(calibration_target instrument2 GroundStation4)
	(calibration_target instrument2 GroundStation7)
	(calibration_target instrument2 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon10)
)
(:goal (and
	(pointing satellite0 GroundStation4)
	(have_image Phenomenon10 thermograph0)
	(have_image Star11 infrared2)
	(have_image Phenomenon12 infrared1)
	(have_image Planet13 infrared2)
	(have_image Planet14 thermograph0)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
2. (turn_to satellite0 star2 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 star2)
   goals met: 0 of 6
3. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 0 of 6
4. (turn_to satellite0 groundstation3 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 groundstation3)
   goals met: 0 of 6
5. (turn_to satellite0 planet13 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 planet13)
   goals met: 0 of 6
6. (take_image satellite0 planet13 instrument0 infrared2)
   added: (have_image planet13 infrared2)
   goals met: 1 of 6
7. (turn_to satellite0 groundstation3 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 groundstation3)
   goals met: 1 of 6
8. (turn_to satellite0 star11 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 star11)
   goals met: 1 of 6
9. (take_image satellite0 star11 instrument0 infrared2)
   added: (have_image star11 infrared2)
   goals met: 2 of 6
10. (turn_to satellite0 groundstation3 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 groundstation3)
   goals met: 2 of 6
11. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 2 of 6
12. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 2 of 6
13. (calibrate satellite0 instrument1 groundstation3)
   added: (calibrated instrument1)
   goals met: 2 of 6
14. (turn_to satellite0 groundstation4 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 groundstation4)
   goals met: 3 of 6
15. (turn_to satellite0 phenomenon10 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 phenomenon10)
   goals met: 2 of 6
16. (take_image satellite0 phenomenon10 instrument1 thermograph0)
   added: (have_image phenomenon10 thermograph0)
   goals met: 3 of 6
17. (turn_to satellite0 groundstation4 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 groundstation4)
   goals met: 4 of 6
18. (turn_to satellite0 phenomenon12 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 phenomenon12)
   goals met: 3 of 6
19. (take_image satellite0 phenomenon12 instrument1 infrared1)
   added: (have_image phenomenon12 infrared1)
   goals met: 4 of 6
20. (turn_to satellite0 groundstation4 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 groundstation4)
   goals met: 5 of 6
21. (turn_to satellite0 planet14 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 planet14)
   goals met: 4 of 6
22. (take_image satellite0 planet14 instrument1 thermograph0)
   added: (have_image planet14 thermograph0)
   goals met: 5 of 6
23. (turn_to satellite0 groundstation4 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 groundstation4)
   goals met: 6 of 6
